app/views/recipes/show.html.erb

<%= f.label :Myfood_lists %>
  <%= f.select :myfood_ids, @current_user.myfoods.pluck(:title, :id), :include_blank => true %>
---
SELECT "myfoods"."id" FROM "myfoods" INNER JOIN "myfoods_recipes" ON "myfoods"."id" = "myfoods_recipes"."myfood_id" WHERE "myfoods_recipes"."recipe_id" = $1  [["recipe_id", 87]]