app/views/users/index.html.erb


<h2> We have <%= User.count %> current users. </h2>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"