app/views/myfoods/index.html.erb

SELECT "myfoods".* FROM "myfoods" WHERE "myfoods"."user_id" = $1  [["user_id", 44]]
---

<% @current_user.myfoods.each do |myfood| %>