app/views/myfoods/show.html.erb


<% @myfood.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "myfoods_recipes" ON "recipes"."id" = "myfoods_recipes"."recipe_id" WHERE "myfoods_recipes"."myfood_id" = $1  [["myfood_id", 47]]