app/controllers/myfoods_controller.rb

  def index
    @myfoods = Myfood.all
---
SELECT "myfoods".* FROM "myfoods"

  def create
    myfood = Myfood.create myfood_params
---
INSERT INTO "myfoods" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Rice"], ["created_at", "2021-10-28 01:14:29.310812"], ["updated_at", "2021-10-28 01:14:29.310812"]]

  def show
    @myfood = Myfood.find params[:id]
---
SELECT  "myfoods".* FROM "myfoods" WHERE "myfoods"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

  def remove_recipe
    myfood = Myfood.find params[:myfood_id]
    recipe = Recipe.find params[:recipe_id]
    myfood.recipes.destroy(recipe)
---
SELECT  "myfoods".* FROM "myfoods" WHERE "myfoods"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
DELETE FROM "myfoods" WHERE "myfoods"."id" = $1  [["id", 47]]

  def destroy
   @myfood = Myfood.find params[:id]
   @myfood.destroy
---
SELECT  "myfoods".* FROM "myfoods" WHERE "myfoods"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
DELETE FROM "myfoods" WHERE "myfoods"."id" = $1  [["id", 47]]