app/controllers/recipes_controller.rb

  def search
    @recipes = Recipe.where("title LIKE ?", "%" + params[:q] + "%")
---
SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%samosa%')

  def create
    recipe = Recipe.create recipe_params
---
INSERT INTO "recipes" ("title", "image", "prep_time", "cook_time", "course", "serves", "main_recipe", "video", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @recipe = Recipe.find params[:id]
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]

 def update
   recipe = Recipe.find params[:id]
   if params[:recipe][:myfood_ids].present?
     @myfood = Myfood.find params[:recipe][:myfood_ids]
     if @myfood.recipes.include? recipe
       redirect_to myfood_path(@myfood)
       flash[:alert] = "Recipe already exists."
     else
     @myfood.recipes << recipe
     redirect_to myfood_path(@myfood)
   end

   else
     recipe.update recipe_params
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
SELECT  "myfoods".* FROM "myfoods" WHERE "myfoods"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
SELECT  1 AS one FROM "recipes" INNER JOIN "myfoods_recipes" ON "recipes"."id" = "myfoods_recipes"."recipe_id" WHERE "myfoods_recipes"."myfood_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["myfood_id", 62], ["id", 94], ["LIMIT", 1]]
UPDATE "recipes" SET "main_recipe" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3

 def edit
  @recipe = Recipe.find params[:id]
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]

 def destroy
  @recipe = Recipe.find params[:id]
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 114], ["LIMIT", 1]]